{
  "format": "layers-model",
  "generatedBy": "keras v2.4.0",
  "convertedBy": "TensorFlow.js Converter v2.7.0",
  "modelTopology": {
    "keras_version": "2.4.0",
    "backend": "tensorflow",
    "model_config": {
      "class_name": "Sequential",
      "config": {
        "name": "sequential",
        "layers": [
          {
            "class_name": "InputLayer",
            "config": {
              "batch_input_shape": [null, 10, 34],
              "dtype": "float32",
              "sparse": false,
              "ragged": false,
              "name": "bidirectional_input"
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm",
                  "trainable": true,
                  "batch_input_shape": [null, 10, 34],
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 400,
                  "activation": "relu",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.0,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dropout",
            "config": {
              "name": "dropout",
              "trainable": true,
              "dtype": "float32",
              "rate": 0.3,
              "noise_shape": null,
              "seed": null
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_1",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_1",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 200,
                  "activation": "relu",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.2,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_2",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_2",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": true,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 100,
                  "activation": "relu",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.2,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Bidirectional",
            "config": {
              "name": "bidirectional_3",
              "trainable": true,
              "dtype": "float32",
              "layer": {
                "class_name": "LSTM",
                "config": {
                  "name": "lstm_3",
                  "trainable": true,
                  "dtype": "float32",
                  "return_sequences": false,
                  "return_state": false,
                  "go_backwards": false,
                  "stateful": false,
                  "unroll": false,
                  "time_major": false,
                  "units": 50,
                  "activation": "relu",
                  "recurrent_activation": "sigmoid",
                  "use_bias": true,
                  "kernel_initializer": {
                    "class_name": "GlorotUniform",
                    "config": { "seed": null }
                  },
                  "recurrent_initializer": {
                    "class_name": "Orthogonal",
                    "config": { "gain": 1.0, "seed": null }
                  },
                  "bias_initializer": { "class_name": "Zeros", "config": {} },
                  "unit_forget_bias": true,
                  "kernel_regularizer": null,
                  "recurrent_regularizer": null,
                  "bias_regularizer": null,
                  "activity_regularizer": null,
                  "kernel_constraint": null,
                  "recurrent_constraint": null,
                  "bias_constraint": null,
                  "dropout": 0.2,
                  "recurrent_dropout": 0.0,
                  "implementation": 2
                }
              },
              "merge_mode": "concat"
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense",
              "trainable": true,
              "dtype": "float32",
              "units": 80,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_1",
              "trainable": true,
              "dtype": "float32",
              "units": 40,
              "activation": "relu",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          },
          {
            "class_name": "Dense",
            "config": {
              "name": "dense_2",
              "trainable": true,
              "dtype": "float32",
              "units": 4,
              "activation": "softmax",
              "use_bias": true,
              "kernel_initializer": {
                "class_name": "GlorotUniform",
                "config": { "seed": null }
              },
              "bias_initializer": { "class_name": "Zeros", "config": {} },
              "kernel_regularizer": null,
              "bias_regularizer": null,
              "activity_regularizer": null,
              "kernel_constraint": null,
              "bias_constraint": null
            }
          }
        ]
      }
    },
    "training_config": {
      "loss": "sparse_categorical_crossentropy",
      "metrics": ["accuracy"],
      "loss_weights": null,
      "sample_weight_mode": null,
      "weighted_metrics": null,
      "optimizer_config": {
        "class_name": "RMSprop",
        "config": {
          "name": "RMSprop",
          "learning_rate": 0.0010000000474974513,
          "decay": 0.0,
          "rho": 0.8999999761581421,
          "momentum": 0.0,
          "epsilon": 1e-7,
          "centered": false
        }
      }
    }
  },
  "weightsManifest": [
    {
      "paths": [
        "group1-shard1of4.bin",
        "group1-shard2of4.bin",
        "group1-shard3of4.bin",
        "group1-shard4of4.bin"
      ],
      "weights": [
        {
          "name": "bidirectional/forward_lstm/lstm_cell_1/kernel",
          "shape": [34, 1600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell_1/recurrent_kernel",
          "shape": [400, 1600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/forward_lstm/lstm_cell_1/bias",
          "shape": [1600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell_2/kernel",
          "shape": [34, 1600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell_2/recurrent_kernel",
          "shape": [400, 1600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional/backward_lstm/lstm_cell_2/bias",
          "shape": [1600],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/kernel",
          "shape": [800, 800],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/recurrent_kernel",
          "shape": [200, 800],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/forward_lstm_1/lstm_cell_4/bias",
          "shape": [800],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/kernel",
          "shape": [800, 800],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/recurrent_kernel",
          "shape": [200, 800],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_1/backward_lstm_1/lstm_cell_5/bias",
          "shape": [800],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/kernel",
          "shape": [400, 400],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/recurrent_kernel",
          "shape": [100, 400],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/forward_lstm_2/lstm_cell_7/bias",
          "shape": [400],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/kernel",
          "shape": [400, 400],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/recurrent_kernel",
          "shape": [100, 400],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_2/backward_lstm_2/lstm_cell_8/bias",
          "shape": [400],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/kernel",
          "shape": [200, 200],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/recurrent_kernel",
          "shape": [50, 200],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/forward_lstm_3/lstm_cell_10/bias",
          "shape": [200],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/kernel",
          "shape": [200, 200],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/recurrent_kernel",
          "shape": [50, 200],
          "dtype": "float32"
        },
        {
          "name": "bidirectional_3/backward_lstm_3/lstm_cell_11/bias",
          "shape": [200],
          "dtype": "float32"
        },
        { "name": "dense/kernel", "shape": [100, 80], "dtype": "float32" },
        { "name": "dense/bias", "shape": [80], "dtype": "float32" },
        { "name": "dense_1/kernel", "shape": [80, 40], "dtype": "float32" },
        { "name": "dense_1/bias", "shape": [40], "dtype": "float32" },
        { "name": "dense_2/kernel", "shape": [40, 4], "dtype": "float32" },
        { "name": "dense_2/bias", "shape": [4], "dtype": "float32" }
      ]
    }
  ]
}
